[
	{
		"name": "Rob Stuurman",
		"slug": "rob-stuurman",
		"subtitle": "Beautiful onepage website for a spiritual healer.",
		"services": ["Frontend", "Deployment", "Aftercare"],
		"years": "2020 - Now",
		"href": "https://robstuurman.nl/",
		"intro": "Rob Stuurman loves helping people through his unique approach as an energetic healer. His wife, Lya, does that as well, but in her own way as Reiki Master. Both of them have more than 20 years of experience as energetic healers, but they weren’t reaching that many people. That is where I come in.",
		"img1": "/images/rob.png",
		"img2": "/images/rob-2.png",
		"img3": "/images/rob-3.png",
		"alt1": "screenshot of landingpage",
		"alt2": "screenshot of calendar",
		"title2": "Sounds nice, but how did you build the website?",
		"alt3": "screenshot of the 'how I work'-element",
		"title3": "And what about hosting?",
		"paragraph1": "Rob's website had a very old look-and-feel to it, think late 90’s. To create a new, fresh design they contacted Soulia Moor from Moor Design. I chipped in with some feedback on the design and did the programming. Besides that they also couldn’t access their files, so they wanted to be hosted on a different platform. In this process I guided them and contacted the previous developer to access their files.",
		"paragraph2": "Let me guide you through my process! At first, to speed up the time it took to develop and deploy Soulia and me decided it was best to create a One Pager without a CMS for now. Since I did want to have this option for a later date, I decided to go with a robust setup of Vue, Vuetify and Nuxt.",
		"paragraph3": "I did a market research and compared multiple hosting providers to find out which one was the best option for Rob and Lya. I always highly prefer ones with good customer service so that in the case something breaks, you have helpful service employees to talk to.",
		"paragraph4": "In the end Cloud86 came out ahead of the other companies on customer service, price, uptime and speed. The website is currently in my aftercare, as such I update it regularly and redo parts of the site when requested. Check out the result through the link below."
	},
	{
		"name": "SorryThieves",
		"slug": "sorry-thieves",
		"subtitle": "Campaign page for E-Bike store VanMoof.",
		"services": ["Frontend"],
		"years": "2019",
		"href": "https://web.archive.org/web/20220808131311/https://www.vanmoof.com/shop/sorrythieves//",
		"intro": "While working on the VanMoof webshop at Reach Digital - due to my knowledge of React and Node - I got the unique opportunity to work on the SorryThieves campaign page.",
		"img1": "/images/sorry-thieves.png",
		"img2": "/images/sorry-thieves-2.png",
		"img3": "/images/sorry-thieves-3.png",
		"alt1": "screenshot of SorryThieves campaign page",
		"alt2": "screenshot of SorryThieves campaign page",
		"alt3": "screenshot of SorryThieves campaign page",
		"title2": "Challenges and hurdles",
		"title3": "And what went well?",
		"paragraph1": "With this campaign page and their policies surrounding it, VanMoof really wants to demonstrate that they are done with bike theft. While their whole webshop was made with Magento, for this project they wanted to step out of that and have a React based webpage for this campaign within 3 days! Beforehand I was asked if I could make this happen, since the design was already done, I jumped at the opportunity and said \"YES let's do this!\"",
		"paragraph2": "Since we had to move fast due to the high pressure of the tight deadline, we chose the technologies fast as well. All of a sudden I had to learn how to work with Material UI, Spring, JSS and TSX in about a day. In hindsight I think we may have gone a bit overboard with this amount of new technologies, but it was a great challenge nonetheless.",
		"paragraph3": "It was very interesting to experience the level of communication between VanMoof, the CTO of Reach Digital and me. Everything went very fast and smooth, well thought out decisions were made on the fly and highly efficient discussions sprang up.",
		"paragraph4": "All in all I definitely learned a lot from this on a technical level, but also on a personal level: That I should stand my ground and make a case for not using too many new technologies at once, especially when it is only for one page. I do love how the page turned out though, sadly VanMoof took it offline and it is only accessible through the waybackmachine."
	},
	{
		"name": "Wintersport",
		"slug": "wintersport",
		"subtitle": "Highly technical platform for wintersports enthusiasts.",
		"services": ["Fullstack Development", "Deployment", "CI/CD"],
		"years": "2020 - 2021",
		"href": "https://wintersport.nl/",
		"intro": "I love to ski, snowboard and sleigh, especially skiing is my favorite sport and since I started at age 4, I am quite capable of getting myself down the mountain. In 2020 I got the opportunity to combine my passion for the sport with my work as a programmer.",
		"img1": "/images/wintersport.png",
		"img2": "/images/wintersport-2.png",
		"img3": "/images/wintersport-3.png",
		"img4": "/images/wintersport-4.png",
		"alt1": "screenshot of wintersport.nl landingpage",
		"alt2": "screenshot of weathermodel component",
		"alt3": "screenshot of gear platform",
		"alt4": "screenshot of ski areas page",
		"title2": "So was it just a website then?",
		"title3": "What is the main takeaway from this project?",
		"title4": "The tech-stack",
		"paragraph1": "Together with other wintersports enthusiasts I helped maintain and develop wintersport.nl - a platform dedicated to both recreational wintersports as well as the professional, olympic side of wintersports.",
		"paragraph2": "While it may sound like maintaining the platform shouldn't take a lot of work, the platform is extremely multifacetted. The components of the website ranged from weathermodels to webcams, multiple forums to an online travel agency, very comprehensive reviewing options, a podcast and a gear platform and last but not least it also included a custom, well-built CMS. We, the developers, had our hands full and never ran out of things to do.",
		"paragraph3": "There were some kinks in the cable when it came to the directness in which I was approached sometimes. We resolved this by having a good conversation about what our expectations were and afterwards this improved our communication greatly since we were all on the same page.",
		"paragraph4": "Other than that I would say, I loved working with all of the new technologies I learnt here. In particular, I really liked working with VueJS, Vuetify, Apollo and GraphQL and this feeling was only enhanced by going to VueJS Amsterdam. There were also a lot of fringe technologies that were used like Knex.js and Pug, these technologies made sense in this project, but I wouldn't necesarily reuse them every time, as such I learnt more about decisionmaking when it comes to picking technologies."
	}
]
